# ShowGraphicalWarningHangerDisconnects Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..ShowGraphicalWarningHangerDisconnects Property
Application Class See Also
---
Whether or not to show the graphical warnings for Fabrication Hanger disconnects.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool ShowGraphicalWarningHangerDisconnects { get; set; }
```

Visual Basic
---
```text
Public Property ShowGraphicalWarningHangerDisconnects As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowGraphicalWarningHangerDisconnects {
	bool get ();
	void set (bool value);
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace